In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv("student1.csv")
df

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [4]:
df[2:3]

   1     anil  TE  56.77  22
2  4  ajinkya  TE  69.66  20

In [5]:
#add or modify

In [6]:
gender = ['m','m','m','f','f','m','f','f','f']
df['gender'] = gender
df

    1     anil  TE  56.77  22 gender
0   2     amit  TE  59.77  21      m
1   3   aniket  BE  76.88  19      m
2   4  ajinkya  TE  69.66  20      m
3   5     asha  TE  63.28  20      f
4   6   ayesha  BE  49.55  20      f
5   7     amar  BE  65.34  19      m
6   8    amita  BE  68.33  23      f
7   9     amol  TE  56.75  20      f
8  10    anmol  BE  78.66  21      f

In [7]:
df ['gender'].value_counts()

gender
f    5
m    4
Name: count, dtype: int64

In [8]:
headers = ["roll","name","class","age"]
df = pd.read_csv("student1.csv",names = headers)
df

       roll name  class  age
1      anil   TE  56.77   22
2      amit   TE  59.77   21
3    aniket   BE  76.88   19
4   ajinkya   TE  69.66   20
5      asha   TE  63.28   20
6    ayesha   BE  49.55   20
7      amar   BE  65.34   19
8     amita   BE  68.33   23
9      amol   TE  56.75   20
10    anmol   BE  78.66   21

In [9]:
df.drop

<bound method DataFrame.drop of        roll name  class  age
1      anil   TE  56.77   22
2      amit   TE  59.77   21
3    aniket   BE  76.88   19
4   ajinkya   TE  69.66   20
5      asha   TE  63.28   20
6    ayesha   BE  49.55   20
7      amar   BE  65.34   19
8     amita   BE  68.33   23
9      amol   TE  56.75   20
10    anmol   BE  78.66   21>

In [10]:
##create a dataframe -> 'newdf'
#columns -> roll,gender,cgpa
#roll columns value should be same as df

In [11]:

roll = pd.Series([1, 2, 3, 4, 5, 6])
gender = pd.Series(['m', 'm', 'm', 'f', 'f', 'f'])
cgpa = pd.Series([3.4, 3.6, 3.2, 3.8, 3.7, 3.9])

df = pd.DataFrame({
    'Roll': roll,
    'Gender': gender,
    'CGPA': cgpa
})

print(df)

   Roll Gender  CGPA
0     1      m   3.4
1     2      m   3.6
2     3      m   3.2
3     4      f   3.8
4     5      f   3.7
5     6      f   3.9

In [13]:
import pandas as pd

df = pd.DataFrame({
    'roll': [1, 2, 3, 4, 5, 6],
    'gender': ['m', 'm', 'm', 'f', 'f', 'f'],
    'cgpa': [3.4, 3.6, 3.2, 3.8, 3.7, 3.9]
})

newdf = pd.DataFrame()
newdf['rollno'] = df['roll']          
newdf['gender'] = None                 
newdf['cgpa'] = None

print(newdf)

   rollno gender  cgpa
0       1   None  None
1       2   None  None
2       3   None  None
3       4   None  None
4       5   None  None
5       6   None  None

In [ ]:
import pandas as pd

# Define the values
roll = range(101, 111)
gender = ['M', 'F', 'M', 'F', 'M', 'F', 'M', 'F', 'M', 'F']
cgpa = [8.2, 9.1, 7.5, 8.9, 7.8, 8.5, 6.9, 9.0, 7.6, 8.3]

# Create the DataFrame
newdf = pd.DataFrame({
    'roll': roll,
    'gender': gender,
    'cgpa': cgpa
})

# Display the DataFrame
print(newdf)

In [ ]:
df = pd.read_csv("student5.csv")
df

In [ ]:
df[df['marks'] > 60]

In [ ]:
#question1:
#create a series of 5 numbers and assign custom labels
import pandas as pd

# Values for the series
data = [10, 20, 30,40,50]

labels = ['a', 'b', 'c','d','e']

s = pd.Series(data, index=labels)

print(s)

In [ ]:
#question2:-
#contruct a dataframe from a dictionary wiht the student names, marks , and cities

name = pd.Series(['Shruti', 'sia', 'ria', 'disha', 'Ravi'])
marks = pd.Series([98, 56, 87, 64,89])
city = pd.Series(['pune','pune','mumbai','beed','satara'])

df = pd.DataFrame({
    'name' : name,
    'marks' : marks,
    'city' : city
})
df

In [ ]:
#Question 3
arr = np.array([10, 20, 39 , 46])
df = pd.DataFrame(arr, columns=['Scores'])
df

In [ ]:
#Question 4:-
#use loc and iloc to select specific rows and columns from a Datafram

df.iloc[:2]
df.loc[2:]

In [ ]:
#Queston5:-
#Apply head(),tail() ,shpae, info() and descibe() to explore a Dataframe
df.head()

In [ ]:
df.tail()

In [ ]:
df.shape

In [ ]:
df.info()

In [ ]:
df.describe()

In [ ]:
#Question6:-
#Sort a Dataframe bu values in a column using sort_index()

df.sort_index